#X Написати функцію, яка приймає два параметри: ім'я файлу та кількість символів. 
#   На екран повинен вивестись список із трьома блоками - символи з початку, із середини та з кінця файлу.
# X  Кількість символів в блоках - та, яка введена в другому параметрі.
#   Придумайте самі, як обробляти помилку, наприклад, коли кількість символів більша, ніж є в файлі (наприклад, файл із двох символів і треба вивести по одному символу, 
#   то що виводити на місці середнього блоку символів?)
#   В репозиторій додайте і ті файли, по яким робили тести.
#   Як визначати середину файлу (з якої брать необхідні символи) - кількість символів поділити навпіл, а отримане "вікно" символів відцентрувати щодо середини файла і взяти необхідну кількість. 
#   В разі необхідності заокруглення одного чи обох параметрів - дивіться на свій розсуд.

#name_file, n
l = []
def block(name_file, n):
    with open(name_file, "r") as f:
        for char in f:
            if len(char) < n * 3:
                raise Exception("Uncorect data: count symbols < n * 3")
            if n < 0:
                raise Exception("n has been >  0")

            i = 0
                
            for simbol in char:
                if(i < n  or i > len(char) - n-1 or i >= (len(char) / 2 - n / 2) and i < (len(char) / 2 + n / 2) ):

                    simbol = "█" 
                else:
                    simbol = '░'
                l.append(simbol)
                i+= 1 

try:       
    block("data.txt", 3)
    print(l)
except Exception as e:
    print(e)





