#7. Реалізуйте генератор, який приймає на вхід будь-яку ітерабельну послідовність (рядок, список, кортеж) і повертає генератор,
#  який буде вертати значення з цієї послідовності,
#  при цьому, якщо було повернено останній елемент із послідовності - ітерація починається знову

def generator(l):
    flag = True
    while flag:
        for i in l:
            flag = False
            yield i
            if l[-1] == i:
                flag = True

        


for elem in generator([1, 2, 3]):
    print(elem)
